Revit 2024 API
ParameterTypeId.DividedSurfaceDisplayPatternLines Property
 "Pattern Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DividedSurfaceDisplayPatternLines { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceDisplayPatternLines As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DividedSurfaceDisplayPatternLines {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace